#+title: Problem Set 0
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2025-11-23>
#+lastmod: <2025-11-23 20:45>
#+options: num:t
#+startup: overview

* Problem 1 [DONE]
** Task
The p-q-formula of quadratic equations leads to

        x^2 - 2px + q = 0,
        x = p ± sqrt{p^2 - q}

Write a function (p,q) -> myPQnaive(p,q) that returns teh zeros x1, and x2.

** Notes
trivial

** Solution
#+begin_src julia :session none :results output
myPQnaive(p,q) = begin
    if (p^2 < q)
        println("sorry buddy, don't work with complex numbers(")
        return
    end
    x1 = p + sqrt(p^2 - q)
    x2 = p - sqrt(p^2 - q)
    return (x1, x2)
end

println(myPQnaive(2,1))
#+end_src

#+RESULTS:
: myPQnaive (generic function with 1 method)
: (3.732050807568877, 0.2679491924311228)

* Problem 2 [DONE]
** Task
Visualize the following sequences
a) a_n := (1 + 1/n)^n for n = 1, 2, ...
b) Plot in the same graph: 1/2^n and 1/n^2, for n = 1, 2, ...
c) For n∈ℕ, put b_n = 1         if n is a squeare
                    = 1/(n+1)   otherwise
d) Find and illustrate the largest element in the sequence (x_n)n∈ℕ, given by
        x_n = n^2 / 2^n, n∈ℕ.

** Notes

** Solution
*** a)
#+begin_src julia :session none :results output
using Pkg
Pkg.add("Plots")
using Plots
#+end_src

#+begin_src julia :tangle plot_script.jl
using Plots
x = range(1, stop=100, length=100)
y = (1 .+ 1 ./ x) .^ x
p = plot(x, y)
savefig(p, "plots/plot-2a.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-2a.png

*** b)
#+begin_src julia :tangle plot_script.jl
using Plots

x = range(1, stop=10, length=100)
y1 = 1 ./ 2 .^ x
y2 = 1 ./ x .^ 2

p = plot(x, y1, label="1/2^x")
plot!(p, x, y2, label="1/x^2")

savefig(p, "plots/plot-2b.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-2b.png

*** c)
#+begin_src julia :tangle plot_script.jl
using Plots

is_perfect_square(n) = n ≥ 0 && floor(sqrt(n))^2 == n

get_y(x) = is_perfect_square(x) ? 1 : 1/(x+1)

x = range(1, stop=10, length=100)
y = get_y.(x)
p = plot!(x, y)

savefig(p, "plots/plot-2c.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-2c.png

*** d)
#+begin_src julia :tangle plot_script.jl
using Plots

get_x_n(n) = n^2 / 2^n

n = range(1, stop=100, length=100)
x_n = get_x_n.(n)
p = plot!(n, x_n)

savefig(p, "plots/plot-2d.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-2d.png

* Problem 3 [DONE]
** Task
Show that

a) \[ \lim_{n \to \infty} \frac{(-1)^n}{n} = 0 \]

b) \[ \lim_{n \to \infty} \frac{4n^2 - 2n + 1}{n^2 - n + 6} = 4 \]

In addition, visualise this behaviour in Julia.

** Notes
Just realised that latex is actually insanely crazy shit. I should use it much much more.

** Solution
*** a)
#+begin_src julia :tangle plot_script.jl
using Plots

n = range(1, stop=100, length=100)
x_n = (-1).^n ./ n

p = plot(n, x_n)

savefig("plots/plot-3a.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-3a.png
*** b)
#+begin_src julia :tangle plot_script.jl
using Plots

n = range(1, stop=100, length=100)
x_n = (4 .* n.^2 - 2 .* n .+ 1)./(n.^2 .- n .+ 6)

p = plot(n, x_n)

savefig("plots/plot-3b.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-3b.png

* Problem 4 [DONE]
** Task
Show that the sequence \( (a_n)_{n\in\mathbb{N}} \), given by

\[ a_n = n + n(-1)^n, \qquad n \in \mathbb{N}, \]

is divergent. Check also in Julia.

** Notes
\[
a_n = n + n(-1)^n = n\bigl(1+(-1)^n\bigr).
\]

For odd \(n=2k-1\) we have \((-1)^n=-1\), hence
\[
a_{2k-1}=(2k-1)\bigl(1-1\bigr)=0.
\]

For even \(n=2k\) we have \((-1)^n=1\), hence
\[
a_{2k}=(2k)\bigl(1+1\bigr)=4k,
\]
which tends to \(+\infty\) as \(k\to\infty\).

Thus one subsequence \((a_{2k-1})\) is constant \(0\) (limit \(0\)) while another subsequence \((a_{2k})\) diverges to \(+\infty\). Therefore \((a_n)\) has no finite limit and is divergent.
\]

** Solution
#+begin_src julia :tangle plot_script.jl
using Plots

n = range(1, stop=100, length=100)
x_n = n .+ n .* (.-1).^n

p = plot(n, x_n)

savefig("plots/plot-4.png")
#+end_src

#+RESULTS:
: /Users/ziro2173/personal/university/notes/courses/analysis/ue/problem-set-0/plots/plot-4.png

* Problem 5
** Task
** Notes
** Solution
